// constants.js

export const stemOrder = ['갑', '을', '병', '정', '무', '기', '경', '신', '임', '계'];
export const branchOrder = ['자', '축', '인', '묘', '진', '사', '오', '미', '신', '유', '술', '해'];
// (필요하면 다른 상수도 여기에 추가)
export const elementColors = {
  '甲': 'green', '乙': 'green', '寅': 'green', '卯': 'green',
  '丙': 'red', '丁': 'red', '巳': 'red', '午': 'red',
  '戊': 'orange', '己': 'orange', '辰': 'orange', '戌': 'orange', '丑': 'orange', '未': 'orange',
  '庚': 'gray', '辛': 'gray', '申': 'gray', '酉': 'gray',
  '壬': 'blue', '癸': 'blue', '子': 'blue', '亥': 'blue'
};

export const hiddenStemsMap = {
  '자': ['임','계'],
  '축': ['계', '신', '기'],
  '인': ['무', '병', '갑'],
  '묘': ['갑', '을'],
  '진': ['을', '계', '무'],
  '사': ['무', '경', '병'],
  '오': ['병', '기', '정'],
  '미': ['정', '을', '기'],
  '신': ['무', '임', '경'],
  '유': ['경', '신'],
  '술': ['신', '정', '무'],
  '해': ['무', '갑', '임']
};

export const tenGodMap = {
  '갑': { '갑': '비견', '을': '겁재', '병': '식신', '정': '상관', '무': '편재', '기': '정재', '경': '편관', '신': '정관', '임': '편인', '계': '정인' },
  '을': { '갑': '겁재', '을': '비견', '병': '상관', '정': '식신', '무': '편재', '기': '정재', '경': '정관', '신': '편관', '임': '편인', '계': '정인' },
  '병': { '갑': '편인', '을': '정인', '병': '비견', '정': '겁재', '무': '식신', '기': '상관', '경': '편재', '신': '정재', '임': '편관', '계': '정관' },
  '정': { '갑': '편인', '을': '정인', '병': '겁재', '정': '비견', '무': '상관', '기': '식신', '경': '편재', '신': '정재', '임': '정관', '계': '편관' },
  '무': { '갑': '정관', '을': '편관', '병': '편인', '정': '정인', '무': '비견', '기': '겁재', '경': '식신', '신': '상관', '임': '편재', '계': '정재' },
  '기': { '갑': '편관', '을': '정관', '병': '편인', '정': '정인', '무': '겁재', '기': '비견', '경': '상관', '신': '식신', '임': '편재', '계': '정재' },
  '경': { '갑': '편재', '을': '정재', '병': '정관', '정': '편관', '무': '편인', '기': '정인', '경': '비견', '신': '겁재', '임': '식신', '계': '상관' },
  '신': { '갑': '편재', '을': '정재', '병': '편관', '정': '정관', '무': '편인', '기': '정인', '경': '겁재', '신': '비견', '임': '상관', '계': '식신' },
  '임': { '갑': '상관', '을': '식신', '병': '편재', '정': '정재', '무': '정관', '기': '편관', '경': '편인', '신': '정인', '임': '비견', '계': '겁재' },
  '계': { '갑': '식신', '을': '상관', '병': '편재', '정': '정재', '무': '편관', '기': '정관', '경': '편인', '신': '정인', '임': '겁재', '계': '비견' },
};

// 월지(月支)에 따른 사령의 앞/뒤 천간
export const saryeongMap = {
  '子': ['壬', '癸'],
  '丑': ['癸', '辛'],
  '寅': ['丙', '甲'],
  '卯': ['甲', '乙'],
  '辰': ['乙', '癸'],
  '巳': ['庚', '丙'],
  '午': ['丙', '丁'],
  '未': ['丁', '乙'],
  '申': ['壬', '庚'],
  '酉': ['庚', '辛'],
  '戌': ['辛', '丁'],
  '亥': ['甲', '壬']
};
